src/Enums/кфк_т_ТестовоеПеречисление/кфк_т_ТестовоеПеречисление.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>кфк_т_ТестовоеПеречисление</name>
  <enumValues>
    <name>Значение1</name>
  </enumValues>
  <enumValues>
    <name>Значение2</name>
  </enumValues>
  <enumValues>
    <name>Значение3</name>
  </enumValues>
</mdclass:Enum>

src/CommonModules/кфк_т_МенеджерОбменаЧерезУниверсальныйФормат/Module.bsl
//@skip-check undefined-variable

////////////////////////////////////////////////////////////////////////////////
// Менеджер обмена через универсальный формат (ТестированиеАдаптераKafka 9.9.9.9 от 27.01.2026 16:21:08)
//
////////////////////////////////////////////////////////////////////////////////
#Область СлужебныйПрограммныйИнтерфейс
#Область ПроцедурыКонвертации
// Процедура, выполняемая перед началом конвертации данных.
//
// Параметры:
//  КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//  ДанныеИБ - СправочникОбъект, ДокументОбъект, Структура - выгружаемые данные ИБ
//
Процедура ПередКонвертацией(КомпонентыОбмена, ДанныеИБ) Экспорт
КонецПроцедуры

// Процедура, выполняемая после выполнения конвертации данных.
//
// Параметры:
//   КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//   ДанныеИБ - СправочникОбъект, ДокументОбъект, Структура - выгружаемые данные ИБ
//   Сообщение - Структура - сформированное сообщение
//
Процедура ПослеКонвертации(КомпонентыОбмена, ДанныеИБ, Сообщение) Экспорт
КонецПроцедуры

// Процедура, выполняемая перед началом отложенного заполнения объектов.
//
// Параметры:
//   КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//
Процедура ПередОтложеннымЗаполнением(КомпонентыОбмена) Экспорт
КонецПроцедуры

#КонецОбласти
// Возвращает версию формата менеджера обмена.
//
// Возвращаемое значение:
//  Строка - номер версии.
//   1 - базовые возможности
//   2 - расширенные возможности конвертации свойств табличных частей и общих составных свойств. Для БСП 2.4.1 и выше
//   3 - предусмотрен обход только заголовков при инициализации ПКС.
Функция ВерсияФорматаМенеджераОбмена() Экспорт
	Возврат "2.КФК";
КонецФункции

// Заполняет таблицу правил обработки данных.
//
// Параметры:
//  НаправлениеОбмена      - Строка - "Отправка" либо "Получение".
//  ПравилаОбработкиДанных - ТаблицаЗначений - таблица правил обработки (ПОД):
//     * Имя - Строка
//     * ОбъектВыборкиФормат - Строка
//     * ТипСсылкиXDTO - ТипЗначенияXDTO
//                     - ТипОбъектаXDTO
//     * ОбъектВыборкиМетаданные - ОбъектМетаданных
//     * ВыборкаДанных - Строка
//     * ИмяТаблицыДляВыборки - Строка
//     * ПриОбработке - Строка
//     * ИспользуемыеПКО - Массив из Строка
// 
Процедура ЗаполнитьПравилаОбработкиДанных(НаправлениеОбмена, ПравилаОбработкиДанных) Экспорт 

	Если НаправлениеОбмена = "Отправка" Тогда
		Если ПравилаОбработкиДанных.Колонки.Найти("ОчисткаДанных") = Неопределено Тогда
			ПравилаОбработкиДанных.Колонки.Добавить("ОчисткаДанных");
		КонецЕсли;
		ДобавитьПОД_РегистрСведений_ТестовыйРегистр_Отправка(ПравилаОбработкиДанных);
		ДобавитьПОД_Справочник_ТестовыйСправочник_Отправка(ПравилаОбработкиДанных);
	ИначеЕсли НаправлениеОбмена = "Получение" Тогда
		ДобавитьПОД_testCatalog_Получение(ПравилаОбработкиДанных);
		ДобавитьПОД_testRegister_Получение(ПравилаОбработкиДанных);
	КонецЕсли;
КонецПроцедуры
// Заполняет таблицу правил конвертации объектов.
//
// Параметры:
//  НаправлениеОбмена  - Строка - "Отправка" либо "Получение".
//  ПравилаКонвертации - ТаблицаЗначений - таблица правил конвертации:
//     * ИмяПКО - Строка
//     * ОбъектДанных - Произвольный
//     * ОбъектФормата - Строка
//     * ТипПолученныхДанныхСтрокой - Строка
//     * ИмяТаблицыПолученныхДанных - Строка
//     * ПредставлениеТипаПолученныхДанных - Строка
//     * Свойства - ТаблицаЗначений
//     * ПоляПоиска - Массив из Строка
//     * ПоляПредставленияОбъекта - Строка
//     * РеквизитыШапкиПолученныхДанных - Массив из Строка
//     * ПриОтправкеДанных - Строка
//     * ПриКонвертацииДанныхXDTO - Строка
//     * ПередЗаписьюПолученныхДанных - Строка
//     * ПослеЗагрузкиВсехДанных - Строка
//     * ПравилоДляГруппыСправочника - Булево
//     * ВариантИдентификации - Строка
//     * РазрешитьСоздаватьОбъектИзСтруктуры - Произвольный
//     * СвойстваТабличныхЧастейОбработанные - ТаблицаЗначений
//     * СвойстваТабличныхЧастей - Структура
//                               -  ТаблицаЗначений
// 
// 
Процедура ЗаполнитьПравилаКонвертацииОбъектов(НаправлениеОбмена, ПравилаКонвертации) Экспорт  
	ДобавитьПКО_РегистрСведений_ТестовыйРегистр(ПравилаКонвертации);
	ДобавитьПКО_Справочник_ТестовыйСправочник(ПравилаКонвертации);
КонецПроцедуры
#Область ПКПД
// Заполняет таблицу правил конвертации предопределенных данных.
//
// Параметры:
//  НаправлениеОбмена - Строка - "Отправка" либо "Получение".
//  ПравилаКонвертации - ТаблицаЗначений - таблица значений, в которую будут добавлены правила. 
Процедура ЗаполнитьПравилаКонвертацииПредопределенныхДанных(НаправлениеОбмена, ПравилаКонвертации) Экспорт

	// Перечисление_ТестовоеПеречисление_Отправка.
	ПравилоКонвертации           = ПравилаКонвертации.Добавить();
	ПравилоКонвертации.ИмяПКПД   = "Перечисление_ТестовоеПеречисление_Отправка";
	ПравилоКонвертации.ТипДанных = Метаданные.Перечисления.кфк_т_ТестовоеПеречисление;
	ПравилоКонвертации.ТипXDTO   = "TestCatalog.Enum";

	ЗначенияДляОтправки = Новый Соответствие;
	ЗначенияДляОтправки.Вставить(Перечисления.кфк_т_ТестовоеПеречисление.Значение1, "Значение1");
	ЗначенияДляОтправки.Вставить(Перечисления.кфк_т_ТестовоеПеречисление.Значение2, "Значение2");
	ЗначенияДляОтправки.Вставить(Перечисления.кфк_т_ТестовоеПеречисление.Значение3, "Значение3");
	ПравилоКонвертации.КонвертацииЗначенийПриОтправке = ЗначенияДляОтправки;
	ЗначенияДляПолучения = Новый Соответствие;
	ЗначенияДляПолучения.Вставить("Значение1", Перечисления.кфк_т_ТестовоеПеречисление.Значение1);
	ЗначенияДляПолучения.Вставить("Значение2", Перечисления.кфк_т_ТестовоеПеречисление.Значение2);
	ЗначенияДляПолучения.Вставить("Значение3", Перечисления.кфк_т_ТестовоеПеречисление.Значение3);
	ПравилоКонвертации.КонвертацииЗначенийПриПолучении = ЗначенияДляПолучения;

КонецПроцедуры
#КонецОбласти

#Область ПараметрыКонвертации
// Заполняет параметры конвертации.
//
// Параметры:
//  ПараметрыКонвертации - Структура - структура, в которую добавляются параметры конвертации:
//                         Ключ - имя параметра, значение - значение параметра, по умолчанию - Неопределено.
//
Процедура ЗаполнитьПараметрыКонвертации(ПараметрыКонвертации) Экспорт
КонецПроцедуры

#КонецОбласти
// Процедура-обертка, выполняет запуск указанной в параметрах процедуры модуля менеджера обмена через формат.
//
// Параметры:
//  ИмяПроцедуры - Строка - имя процедуры этого модуля.
//  Параметры - Структура:
//    * ОбъектОбработки - Произвольный
//    * ИспользованиеПКО - Структура
//    * КомпонентыОбмена - см. кфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//    * ДанныеИБ - СправочникОбъект
//               - ДокументОбъект
//               - и т.п.
//    * ПолученныеДанные - СправочникОбъект
//                       - ДокументОбъект
//                       - и т.п.
//    * КонвертацияСвойств - ТаблицаЗначений
//    * ДанныеXDTO - см. кфкОбменДаннымиXDTOСервер.ДанныеXDTOИзДанныхИБ
//    * СтекВыгрузки - Массив из Произвольный
//
Процедура ВыполнитьПроцедуруМодуляМенеджера(ИмяПроцедуры, Параметры) Экспорт
КонецПроцедуры


#КонецОбласти
#Область СлужебныеПроцедурыИФункции
Функция Подключаемый_ИдентификаторМодуля() Экспорт
	Возврат "5fef92ef-5ee6-45a2-b668-7df1e8167382";
КонецФункции
#Область ПОД
#Область Отправка
// Параметры:
//  ПравилаОбработкиДанных - см. кфкОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных
// 
Процедура ДобавитьПОД_РегистрСведений_ТестовыйРегистр_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "РегистрСведений_ТестовыйРегистр_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.РегистрыСведений.кфк_т_ТестовыйРегистр;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрСведений_ТестовыйРегистр");
КонецПроцедуры

// Параметры:
//  ПравилаОбработкиДанных - см. кфкОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных
// 
Процедура ДобавитьПОД_Справочник_ТестовыйСправочник_Отправка(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "Справочник_ТестовыйСправочник_Отправка";
	ПравилоОбработки.ОбъектВыборкиМетаданные = Метаданные.Справочники.кфк_т_ТестовыйСправочник;
	ПравилоОбработки.ОчисткаДанных           = Ложь;
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ТестовыйСправочник");
КонецПроцедуры


#КонецОбласти
#Область Получение
// Параметры:
//  ПравилаОбработкиДанных - см. кфкОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных
// 
Процедура ДобавитьПОД_testCatalog_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "testCatalog_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "TestCatalog";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("Справочник_ТестовыйСправочник");
КонецПроцедуры

// Параметры:
//  ПравилаОбработкиДанных - см. кфкОбменДаннымиXDTOСервер.ТаблицаПравилОбработкиДанных
// 
Процедура ДобавитьПОД_testRegister_Получение(ПравилаОбработкиДанных)
	ПравилоОбработки                         = ПравилаОбработкиДанных.Добавить();
	ПравилоОбработки.Имя                     = "testRegister_Получение";
	ПравилоОбработки.ОбъектВыборкиФормат     = "TestRegister";
	ПравилоОбработки.ИспользуемыеПКО.Добавить("РегистрСведений_ТестовыйРегистр");
КонецПроцедуры


#КонецОбласти

#КонецОбласти
#Область ПКО
#Область РегистрыСведений
// Параметры:
//  ПравилаКонвертации - см. кфкОбменДаннымиXDTOСервер.КоллекцияПравилКонвертации 
//
Процедура ДобавитьПКО_РегистрСведений_ТестовыйРегистр(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "РегистрСведений_ТестовыйРегистр";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.РегистрыСведений.кфк_т_ТестовыйРегистр;
	ПравилоКонвертации.ОбъектФормата                      = "TestRegister";
	ПравилоКонвертации.ВариантИдентификации               = "ПоУникальномуИдентификатору";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Булево",         "boolean");
	ДобавитьПКС(СвойстваШапки, "ДатаИВремя",     "dateTime");
	ДобавитьПКС(СвойстваШапки, "Идентификатор",  "uuid");
	ДобавитьПКС(СвойстваШапки, "Комментарий",    "comment");
	ДобавитьПКС(СвойстваШапки, "Период",         "period");
	ДобавитьПКС(СвойстваШапки, "ТестоваяСсылка", "testRef");
	ДобавитьПКС(СвойстваШапки, "Число",          "number");
КонецПроцедуры


#КонецОбласти
// РегистрыСведений
#Область Справочники
// Параметры:
//  ПравилаКонвертации - см. кфкОбменДаннымиXDTOСервер.КоллекцияПравилКонвертации 
//
Процедура ДобавитьПКО_Справочник_ТестовыйСправочник(ПравилаКонвертации)
	ПравилоКонвертации = кфкОбменДаннымиXDTOСервер.ИнициализироватьПравилоКонвертацииОбъекта(ПравилаКонвертации);
	ПравилоКонвертации.ИмяПКО                             = "Справочник_ТестовыйСправочник";
	ПравилоКонвертации.ОбъектДанных                       = Метаданные.Справочники.кфк_т_ТестовыйСправочник;
	ПравилоКонвертации.ОбъектФормата                      = "TestCatalog";
	ПравилоКонвертации.ВариантИдентификации               = "ПоУникальномуИдентификатору";
	СвойстваШапки = ПравилоКонвертации.Свойства;
	ДобавитьПКС(СвойстваШапки, "Булево",       "boolean");
	ДобавитьПКС(СвойстваШапки, "ДатаИВремя",   "dateTime");
	ДобавитьПКС(СвойстваШапки, "Комментарий",  "comment");
	ДобавитьПКС(СвойстваШапки, "Наименование", "name");
	ДобавитьПКС(СвойстваШапки, "Перечисление", "enum", , "Перечисление_ТестовоеПеречисление_Отправка");
	ДобавитьПКС(СвойстваШапки, "Ссылка",       "ref");
	ДобавитьПКС(СвойстваШапки, "Число",        "number");
	
	СвойстваТЧ = ДобавитьПКТЧ(ПравилоКонвертации, "ТабличнаяЧасть", "tabularSection");
	ДобавитьПКС(СвойстваТЧ, "ДатаИВремя", "dateTime");
	ДобавитьПКС(СвойстваТЧ, "Строка",     "string");

КонецПроцедуры


#КонецОбласти
// Справочники

#КонецОбласти


Функция ДобавитьПКТЧ(ПравилоКонвертации, ИмяТЧКонфигурации, ИмяТЧФормата, ПространствоИмен = "")
	
	Если ПравилоКонвертации.СвойстваТабличныхЧастей.Колонки.Количество() = 0 Тогда
		кфкОбменДаннымиXDTOСервер.ИнициализироватьСвойстваТабличныхЧастей(ПравилоКонвертации);
	КонецЕсли;
	
	КонвертацияТабличнойЧасти                = ПравилоКонвертации.СвойстваТабличныхЧастей.Добавить();
	КонвертацияТабличнойЧасти.ТЧКонфигурации = ИмяТЧКонфигурации;
	КонвертацияТабличнойЧасти.ТЧФормата      = ИмяТЧФормата;
	КонвертацияТабличнойЧасти.Свойства       = кфкОбменДаннымиXDTOСервер.ИнициализироватьТаблицуСвойствДляПравилаКонвертации();
	КонвертацияТабличнойЧасти.ПространствоИмен = ПространствоИмен;
	Возврат КонвертацияТабличнойЧасти.Свойства;
КонецФункции

Процедура ДобавитьПКС(РодительПКС, СвойствоКонфигурации, СвойствоФормата, ИспользуетсяАлгоритмКонвертации = 0, 
		ПравилоКонвертацииСвойства = "", ПространствоИмен = "")
	НоваяСтрока                                 = РодительПКС.Добавить();
	НоваяСтрока.СвойствоКонфигурации            = СвойствоКонфигурации;
	НоваяСтрока.СвойствоФормата                 = СвойствоФормата;
	НоваяСтрока.ИспользуетсяАлгоритмКонвертации = ?(ИспользуетсяАлгоритмКонвертации = 0, Ложь, Истина);
	НоваяСтрока.ПравилоКонвертацииСвойства      = ПравилоКонвертацииСвойства;
	НоваяСтрока.ПространствоИмен                = ПространствоИмен;
КонецПроцедуры

#Область Алгоритмы

Процедура тест()
	
КонецПроцедуры

#КонецОбласти

#Область КФК

// Возвращает свойство сообщения
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена 
//	ИмяСвойства - Строка - Имя свойства
// 
// Возвращаемое значение:
//	Неопределено, Произвольный - Значение свойства сообщения
Функция СвойствоСообщения(КомпонентыОбмена, ИмяСвойства)
	
	Результат = Неопределено;
	Если Не КомпонентыОбмена.СвойстваСообщения.Свойство(ИмяСвойства, Результат) Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru = 'Неправильно задано имя свойства сообщения: %1'"), ИмяСвойства);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Устанавливает флаг пропуска и добавляет комментарий в протокол
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
//	ТекстСообщения - Строка - Текст сообщения
Процедура Пропустить(КомпонентыОбмена, ТекстСообщения = "")
	
	КомпонентыОбмена.ФлагПропустить = Истина;
	
	Если Не ПустаяСтрока(ТекстСообщения) Тогда
		КомпонентыОбмена.ПротоколКонвертации.Добавить(ТекстСообщения);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет ошибку в протокол.
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена 
//	ТекстОшибки - Строка - Текст ошибки
Процедура Ошибка(КомпонентыОбмена, ТекстОшибки)
	
	КомпонентыОбмена.ФлагОшибки = Истина;
	
	Если Не ПустаяСтрока(ТекстОшибки) Тогда
		КомпонентыОбмена.ПротоколКонвертации.Добавить(ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

#Область СобытияРегистрации

// Это регистрация при записи.
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
// 
// Возвращаемое значение:
//  Булево - Это регистрация при записи
Функция ЭтоРегистрацияПриЗаписи(КомпонентыОбмена)
	
	Если КомпонентыОбмена.НаправлениеОбмена <> "Отправка" Тогда
		ВызватьИсключение НСтр("ru = 'Неверное направление обмена!'");
	КонецЕсли;
	
	Событие = СвойствоСообщения(КомпонентыОбмена, "СобытиеРегистрации");
	Если Событие = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не указано событие регистрации!'");
	КонецЕсли;
	
	Возврат Событие = Перечисления.кфкСобытияРегистрации.ПриЗаписи;
	
КонецФункции

// Это регистрация программно.
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
// 
// Возвращаемое значение:
//  Булево - Это регистрация программно
Функция ЭтоРегистрацияПрограммно(КомпонентыОбмена)
	
	Если КомпонентыОбмена.НаправлениеОбмена <> "Отправка" Тогда
		ВызватьИсключение НСтр("ru = 'Неверное направление обмена!'");
	КонецЕсли;
	
	Событие = СвойствоСообщения(КомпонентыОбмена, "СобытиеРегистрации");
	Если Событие = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не указано событие регистрации!'");
	КонецЕсли;
	
	Возврат Событие = Перечисления.кфкСобытияРегистрации.Программно;
	
КонецФункции

// Это регистрация принудительно.
// 
// Параметры:
//	КомпонентыОбмена - см. кфккфккфкОбменДаннымиXDTOСервер.ИнициализироватьКомпонентыОбмена
// 
// Возвращаемое значение:
//  Булево - Это регистрация принудительно
Функция ЭтоРегистрацияПринудительно(КомпонентыОбмена)
	
	Если КомпонентыОбмена.НаправлениеОбмена <> "Отправка" Тогда
		ВызватьИсключение НСтр("ru = 'Неверное направление обмена!'");
	КонецЕсли;
	
	Событие = СвойствоСообщения(КомпонентыОбмена, "СобытиеРегистрации");
	Если Событие = Неопределено Тогда
		ВызватьИсключение НСтр("ru = 'Не указано событие регистрации!'");
	КонецЕсли;
	
	Возврат Событие = Перечисления.кфкСобытияРегистрации.Принудительно;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти
